var arrLang = {
    "zh-ch": {
        "renew":"2020.6.29，目前为半成品，持续更新中，对不起我就烂(┛`д´)┛",
        "renew2":"2020.6.30 试着用google drive分享此网成功了，目前只有获取此网址的人能使用此网",
        "renew3":"2020.7.1 UI优化，新增免责声明",
        "renew4":"2020.7.2 UI再优化，新增背景图作者连结、少许音档，本来想做响应式网页但...对!我就烂，我再努力想想",
        "renew5":"2020.7.3 更改按钮样式，增加文字清析度​​，新增8个按钮，响应式网页学习中，今天比较混没做什么",
        "renew6":"2020.7.13 新增网域并藉由github同步更新，终于不用再用那个烂东西了~~(洒花",
        "renew7":"2020.7.14 修正navbar跑位问题",
        "renew8":"2020.7.15 新增全声音的控制扭&少许音档",
        "renew9":"2020.7.19 新增简繁语言转换",
    },
    "zh-tw" :{
        "renew":"2020.6.29，目前為半成品，持續更新中，對不起我就爛(┛`д´)┛",
        "renew2":"2020.6.30 試著用google drive分享此網成功了，目前只有獲取此網址的人能使用此網",
        "renew3":"2020.7.1 UI優化，新增免責聲明",
        "renew4":"2020.7.2 UI再優化，新增背景圖作者連結、少許音檔，本來想做響應式網頁但...對!我就爛，我再努力想想",
        "renew5":"2020.7.3 更改按鈕樣式，增加文字清析度，新增8個按鈕，響應式網頁學習中，今天比較混沒做什麼",
        "renew6":"2020.7.13 新增網域並藉由github同步更新，終於不用再用那個爛東西了~~(灑花",
        "renew7":"2020.7.14 修正navbar跑位問題",
        "renew8":"2020.7.15 新增全聲音的控制扭&少許音檔",
        "renew9":"2020.7.19 新增簡繁語言轉換",
    },
};

$(function(){
    $('.translate').click(function(){
        var lang = $(this).attr('id');

        $('.lang').each(function(index, element){
            $(this).text(arrLang[lang][$(this).attr('key')]);
        });
    });
})